import Queue

# Створити чергу заявок
queue = Queue()

def generate_request():
    pass
    # Створити нову заявку
    # Додати заявку до черги

def process_request():
    pass
    # Якщо черга не пуста:
    #     Видалити заявку з черги
    #     Обробити заявку
    # В іншому випадку::
    #     Вивести повідомлення, що черга пуста

# Головний цикл програми:
#     Поки користувач не вийде з програми:
#         Виконати generate_request() для створення нових заявок
#         Виконати process_request() для обробки заявок
